{
  "nav": {
    "home": "Головна",
    "instructions": "Інструкція",
    "diagnostics": "Діагностика",
    "about": "Про нас",
    "login": "Увійти",
    "signup": "Зареєструватись",
    "slogan": "Класифікація захворювань шкіри з використанням пояснювального ШІ",
    "language": "Мова"
  },
  "mainHero": {
    "subtitle": "Класифікація захворювань шкіри з використанням пояснювального ШІ",
    "description": "Завантажте фото ураженої шкіри — система не лише визначить тип захворювання, а й надасть зрозуміле пояснення результату.",
    "tryButton": "Спробувати"
  },
  "instructionSteps": {
    "title" : "Як це працює?",
    "upload": "Завантажте фото шкіри",
    "uploadDesc": "Зробіть чітке фото ураженої ділянки шкіри та завантажте його у систему",
    "analysis": "Отримайте діагноз",
    "analysisDesc": "Система проаналізує зображення та визначить ймовірний клас захворювання серед 7 можливих варіантів.",
    "results": "Перегляньте пояснення",
    "resultsDesc": "Оберіть один із методів пояснювального ШІ, щоб побачити, на які області зображення модель звернула найбільшу увагу."
  },
  "features": {
    "mainTitle": "Чому ",
    "autoClassification": "Автоматична класифікація захворювань",
    "autoClassificationDesc": "Система автоматично розпізнає один із семи типів дерматологічних захворювань за зображенням шкіри. Просто завантажте зображення і отримайте попередній діагноз.",
    "xai": "Пояснення результатів за допомогою пояснювального ШІ",
    "xaiDesc": "Ми не просто даємо відповідь — ми пояснюємо її. Оберіть будь-який метод пояснюваного ШІ: Grad-CAM, LIME, SHAP, Integrated Gradients і дізнайтесь, чому модель ухвалила саме таке рішення.",
    "history": "Історія діагнозів для зареєстрованих користувачів",
    "historyDesc": "Зберігайте свої результати в особистому кабінеті, повертайтеся до них у будь-який момент.",
    "noRegistration": "Швидкий доступ без реєстрації",
    "noRegistrationDesc": "Ми цінуємо ваш час — тому сновні функції навіть без створення облікового запису.",
    "responsive": "Адаптивний інтерфейс",
    "responsiveDesc": "Зручний інтерфейс на будь-якому пристрої. Жодних ускладнень — лише зручність."
  },
  "warning": {
    "title": "Важливо знати",
    "description": "Наша система надає лише попередню класифікацію захворювань на основі штучного інтелекту. Результати не замінюють консультації з лікарем. Для точного діагнозу обов'язково зверніться до дерматолога."
  },
  "diseases": {
    "carousel": {
      "title": "Види шкірних захворювань"
    },
    "common": {
      "symptoms": "Симптоми",
      "treatment": "Лікування"
    },
    "akiec": {
      "name": "Актинічний кератоз",
      "description": "Передракові ураження шкіри, спричинені тривалим впливом ультрафіолетового випромінювання.",
      "symptoms": "Шорсткі, лускаті плями або бляшки на відкритих ділянках шкіри, зазвичай рожевого, червоного або коричневого кольору.",
      "treatment": "Кріотерапія, місцеві препарати (наприклад, 5-фторурацил, іміквімод), фотодинамічна терапія або хірургічне видалення."
    },
    "bcc": {
      "name": "Базально-клітинна карцинома",
      "description": "Найпоширеніший тип раку шкіри, який зазвичай повільно росте та рідко метастазує.",
      "symptoms": "Перламутровий або восковий вузлик, плоска, луската пляма або рубцеподібне утворення, часто з видимими кровоносними судинами.",
      "treatment": "Хірургічне видалення, операція Моса, кріотерапія, фотодинамічна терапія або місцеві препарати."
    },
    "bkl": {
      "name": "Себорейний кератоз",
      "description": "Доброякісні новоутворення шкіри, які часто з'являються з віком.",
      "symptoms": "Коричневі, чорні або світло-бежеві утворення з восковою або лускатою текстурою, що виглядають як приклеєні до шкіри.",
      "treatment": "Зазвичай не потребує лікування, але може бути видалений кріотерапією, кюретажем або лазерною терапією з косметичних міркувань."
    },
    "df": {
      "name": "Дерматофіброма",
      "description": "Доброякісне фіброзне новоутворення шкіри, яке часто виникає після незначної травми.",
      "symptoms": "Маленькі, щільні, червоно-коричневі вузлики, які можуть западати при натисканні.",
      "treatment": "Зазвичай не потребує лікування, але може бути хірургічно видалена, якщо викликає дискомфорт або з косметичних причин."
    },
    "mel": {
      "name": "Меланома",
      "description": "Агресивна форма раку шкіри, що виникає з меланоцитів.",
      "symptoms": "Нова пляма або існуюча родимка, яка змінює розмір, форму або колір; може кровоточити або свербіти.",
      "treatment": "Хірургічне видалення, імунотерапія, таргетна терапія, променева терапія або хіміотерапія, залежно від стадії захворювання."
    },
    "nv": {
      "name": "Меланоцитарний невус",
      "description": "Звичайні родимки, утворені скупченнями пігментних клітин (меланоцитів).",
      "symptoms": "Маленькі, однорідні, круглі або овальні плями темно-коричневого або чорного кольору.",
      "treatment": "Зазвичай не потребує лікування, але підозрілі або змінені родимки слід оцінити дерматологом; можливе хірургічне видалення."
    },
    "vasc": {
      "name": "Судинні ураження",
      "description": "Ураження шкіри, спричинені аномальним розвитком або розширенням кровоносних судин.",
      "symptoms": "Червоні або фіолетові плями чи вузлики на шкірі, можуть бути плоскими або піднятими.",
      "treatment": "Лазерна терапія (наприклад, пульсуючий барвниковий лазер), склеротерапія або хірургічне втручання залежно від типу та розміру ураження."
    }
  },

  "footer": {
    "description": "Розширена система виявлення шкірних захворювань на основі штучного інтелекту",
    "navigation": "Навігація",
    "contact": "Контакти",
    "copyright": "© 2025 SkinInsight AI. Всі права захищені."
  }
}