{
  "nav": {
    "home": "Головна",
    "instructions": "Інструкція",
    "diagnostics": "Діагностика",
    "about": "Про нас",
    "login": "Увійти",
    "signup": "Зареєструватись",
    "slogan": "Класифікація захворювань шкіри з використанням пояснювального ШІ",
    "language": "Мова"
  },
  "mainHero": {
    "subtitle": "Класифікація захворювань шкіри з використанням пояснювального ШІ",
    "description": "Завантажте фото ураженої шкіри — система не лише визначить тип захворювання, а й надасть зрозуміле пояснення результату.",
    "tryButton": "Спробувати"
  },
  "instructionSteps": {
    "title" : "Як це працює?",
    "upload": "Завантажте фото шкіри",
    "uploadDesc": "Зробіть чітке фото ураженої ділянки шкіри та завантажте його у систему",
    "analysis": "Отримайте діагноз",
    "analysisDesc": "Система проаналізує зображення та визначить ймовірний клас захворювання серед 7 можливих варіантів.",
    "results": "Перегляньте пояснення",
    "resultsDesc": "Оберіть один із методів пояснювального ШІ, щоб побачити, на які області зображення модель звернула найбільшу увагу."
  },
  "features": {
    "mainTitle": "Чому ",
    "autoClassification": "Автоматична класифікація захворювань",
    "autoClassificationDesc": "Система автоматично розпізнає один із семи типів дерматологічних захворювань за зображенням шкіри. Просто завантажте зображення і отримайте попередній діагноз.",
    "xai": "Пояснення результатів за допомогою пояснювального ШІ",
    "xaiDesc": "Ми не просто даємо відповідь — ми пояснюємо її. Оберіть будь-який метод пояснюваного ШІ: Grad-CAM, LIME, SHAP, Integrated Gradients і дізнайтесь, чому модель ухвалила саме таке рішення.",
    "history": "Історія діагнозів для зареєстрованих користувачів",
    "historyDesc": "Зберігайте свої результати в особистому кабінеті, повертайтеся до них у будь-який момент.",
    "noRegistration": "Швидкий доступ без реєстрації",
    "noRegistrationDesc": "Ми цінуємо ваш час — тому сновні функції навіть без створення облікового запису.",
    "responsive": "Адаптивний інтерфейс",
    "responsiveDesc": "Зручний інтерфейс на будь-якому пристрої. Жодних ускладнень — лише зручність."
  },
  "warning": {
    "title": "Важливо знати",
    "description": "Наша система надає лише попередню класифікацію захворювань на основі штучного інтелекту. Результати не замінюють консультації з лікарем. Для точного діагнозу обов'язково зверніться до дерматолога."
  }
}